pages/03_The_Founding_of_the_Club.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml"
      xmlns:og="http://ogp.me/ns#"
      xmlns:fb="https://www.facebook.com/2008/fbml">
<head>
    <title>The Founding of the Club.</title>
    <!-- Using the latest rendering mode for IE -->
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Open Graph tags -->

            <meta property="og:type" content="article"/>
            <meta property="og:title" content="The Founding of the Club."/>
            <meta property="og:url" content="http://thecastle.github.io/thecastle/pages/03_The_Founding_of_the_Club.html"/>

    <!-- Bootstrap -->
        <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/bootstrap.readable.min.css" type="text/css"/>
    <link href="http://thecastle.github.io/thecastle/theme/css/font-awesome.min.css" rel="stylesheet">
    <link href="http://thecastle.github.io/thecastle/theme/css/pygments.css" rel="stylesheet">
    <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/style.css" type="text/css"/>
    <!-- JavaScript plugins (requires jQuery) -->


</head>
<body>
<nav class="navbar navbar-default navbar-fixed-top" role="navigation">
    <div class="container">
        <div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a href="http://thecastle.github.io/thecastle" class="navbar-brand">The Castle Mountaineering Club.</a>
        </div>
        <div class="collapse navbar-collapse navbar-ex1-collapse">
            <ul class="nav navbar-nav">
            </ul>
            <ul class="nav navbar-nav navbar-right">
                <li><a href="http://thecastle.github.io/thecastle/archives.html"><i class="icon-th-list"></i>Archives</a></li>
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
</nav>
<!-- /.navbar -->
<div class="container">
    <div class="row">
        <div class="col-lg-9">
    <section id="content" class="body">

        <div class="entry-content">
            

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">The Founding of the Club.</h2>
<div class="outline-text-2" id="text-1">
<div class="export">
<p>
&lt;p&gt;
&lt;em&gt;by Mike Anderson&lt;/em&gt;
&lt;/p&gt;
</p>

</div>

<p>
Langdale, 29th September 1967: torrential rain, the road flooded in
several places, the campsite very much the same. Hardly an auspicious
first meet for a new Club, but one that is nevertheless still
flourishing twenty one years later. All members of the Club have since
experienced similar discomforts, with the additional attractions of
cold, hail, sleet and snow. Now at last we can reveal where the
responsibility lies.
</p>

<p>
Alec Barclay came from across the Border to seek satisfaction for
causes long gone: at least that is what we put it down to when we were
induced to go to Scotland and elsewhere to be tortured by long walks
and hard climbs. Alec and his colleague Colin Mackie had first taken a
small party of Sheffielders for a weekend in Glencoe in March 1967,
followed by a further visit in July the same year. It was after these
trips that the idea of forming a club came to Alec. Discussions back
in Sheffield met with enthusiasm and convinced Alec that he had the
nucleus for the formation of a viable club.
</p>

<p>
A nine strong meeting of stalwarts held at Ashley and Avril Turner&rsquo;s
house on Monday 25th September 1967 led directly to the founding of
the Club. As all of them were &ldquo;regulars&rdquo; at The Castle Inn at Bradway
it was natural and appropriate as they intended to meet there on their
weekly club night that the Inn should lend its name to the Club. But
what to call it? The Castle Climbing Club, or The Castle
Mountaineering Club? After a long discussion it was decided to name it
&ldquo;The Castle Mountaineering Club&rdquo;, in the belief that this title
indicating the basic principle of putting one foot in front of the
other to gain height would provide the widest possible base for the
Club and give encouragement to prospective new members.
</p>

<p>
A proposal by Alec that the Club should exist to further the spirit of
mountaineering on the one hand and to offer instruction in specific
techniques on the other, was duly accepted. It was agreed that The
Castle Inn should be the Club&rsquo;s headquarters until suitable premises
could be found. Alec himself would act as first Hon. Secretary and
Colin Mackie as first President, a , committee was duly elected and a
constitution adopted on 9th October 1967.
</p>

<p>
The success of The Castle Mountaineering Club owes a great deal to the
decision taken in those early days to establish the Club as a
&ldquo;Mountaineering Club&rdquo;. Members have been encouraged over the years to
extend their mountaineering skills over a wide range of activities, be
they climbing, hill walking, skiing or pot holing even pot holing: a
little difficult to put one foot in front of the other underground and
still gain height! Whatever the activity, the Club has always afforded
opportunities for its members to acquire experience in all aspects of
climbing and mountaineering.
</p>

<p>
Regular meets were held from the outset with climbing sessions every
week on local Edges and an away meet each month to different parts of
England, Wales and Scotland. The Club rapidly became something of a
family with meetings in members&rsquo; houses and with slide shows and
lectures in addition to the regular club nights at The Castle Inn.
</p>

<p>
THE FIRST STEPS HAD BEEN SUCCESSFULLY TAKEN.
</p>

<p>
But with growing membership, the need to find a clubroom which would
fulfil one of The Castle&rsquo;s ambitions soon became apparent. That saga,
an epic in its own right, was about to begin.
</p>
</div>
</div>

        </div>
    </section>
        </div>
        <div class="col-lg-3 well well-sm" id="sidebar">

<aside>
    <section>

        <ul class="list-group list-group-flush">
             <li class="list-group-item"><h4><i class="icon-search icon-large"></i>Search</h4></li>

                   <li class="list-group-item"><h4><i class="icon-book icon-large"></i>Pages</h4></li>



                <li class="list-group-item"><a href="http://thecastle.github.io/thecastle/tags.html"><h4><i class="icon-tags icon-large"></i>Tags</h4></a></li>
        </ul>
    </section>
</aside>        </div>
    </div>
</div>
<footer>
    <div class="container">
        <hr>
        <p class="pull-right"><i class="icon-arrow-up"></i> <a href="#">Back to top</a></p>


        <p>&copy;  The Castle Mountaineering Club. &middot; Powered by <a href="https://github.com/DandyDev/pelican-bootstrap3" target="_blank">pelican-bootstrap3</a>,
            <a href="http://docs.getpelican.com/" target="_blank">Pelican</a>,
            <a href="http://getbootstrap.com" target="_blank">Bootstrap</a></p>
    </div>
</footer>
<!-- Include all compiled plugins (below), or include individual files as needed -->
<script src="http://thecastle.github.io/thecastle/theme/js/bootstrap.min.js"></script>

<!-- Enable responsive features in IE8 with Respond.js (https://github.com/scottjehl/Respond) -->
<script src="http://thecastle.github.io/thecastle/theme/js/respond.min.js"></script>


</body>
</html>